-- Свежие активные студенты
create table _d_students (user_id integer);
insert into _d_students
with pre as (
select student_id, group_id, count(distinct problem_id) probs
from results where lesson = 23
group by 1, 2),
   pre2 as (
       select student_id, group_id, probs, row_number() over (partition by group_id order by probs desc) rn
       from pre
   )
select student_id from pre2 where rn <= 5;

-- Их учителя
create table _d_teachers (user_id integer);
insert into _d_teachers
with pre as (
select r.teacher_id, r.group_id, count(*) probs
from results r
where student_id in (select user_id from _d_students)
and lesson >= 20 and r.teacher_id is not null
group by 1, 2
    ),
pre2 as (select *, row_number() over (partition by group_id order by probs desc) rn
         from pre)
select teacher_id from pre2
where rn <= 3;

-- ======================
-- ======================

select * from users where id in (select * from _d_students) or id in (select * from _d_teachers);

insert into main.users (id, chat_id, type, group_id, name, surname, middlename, token, online, grade, birthday)
values  (7230, 1896934150, 1, 'н', 'Севастьян А.', 'Игнатов', '', 'se2ra3ry7', 1, null, '2014-10-29'),
        (7281, 6706299281, 1, 'н', 'Мария И.', 'Дубровская', '', 'fu2cy3be2', 1, 4, '2015-03-24'),
        (7282, null, 1, 'н', 'Анна И.', 'Дубровская', '', 'ga9xa9xe3', 1, 4, '2015-03-24'),
        (7309, 304220222, 1, 'н', 'Александр', 'Котелевский', '', 'ga2ky9ke4', 2, 5, '2014-05-27'),
        (7317, 278941220, 1, 'н', 'Аркадий', 'Беляков', '', 'py7ta9se6', 2, 5, '2014-06-25'),
        (7435, 6225539565, 1, 'э', 'Стефания', 'Осипова', '', 'we8xu4vy6', 1, 6, '2013-08-26'),
        (7476, 7236643899, 1, 'э', 'Иван', 'Моисеев', '', 'gy6ca8he5', 1, 6, '2013-08-17'),
        (7550, 950305852, 1, 'п', 'Якуб', 'Мекалиш', '', 'ga9na2ju3', 1, 4, '2015-10-03'),
        (7551, 1647346416, 1, 'п', 'Роман', 'Платонов', '', 'qu9sa3qu5', 1, 7, '2014-01-06'),
        (7656, 6868442647, 1, 'э', 'Савелий', 'Зубарев', '', 'ba2ju2qy4', 2, 6, '2013-12-18'),
        (7673, 5650544201, 1, 'э', 'Владислав', 'Медвецкий', '', 'gy2hy5ku4', 1, 6, '2013-12-16'),
        (7680, 8342729182, 1, 'п', 'Юрий', 'Бородин', '', 'ca4he2zy6', 1, 6, '2013-04-02'),
        (7703, 5842584958, 1, 'п', 'Лев', 'Большаков', '', 'my5qu3tu3', 1, 6, '2013-08-04'),
        (7718, 5062806912, 1, 'п', 'Сергей', 'Бушин', '', 'ja2we6qe8', 2, 6, '2012-09-04'),
        (7796, 5430820763, 1, 'э', 'Иван А.', 'Медведев', '', 'gu2cu8va4', 1, 6, '2013-08-07'),
        (4, 586091311, 2, 'н', 'Ирина', 'Зиненко', 'Уч179', 'cqwn47ff', 1, null, null),
        (4234, 160395642, 2, 'п', 'Георгий', 'Липинский', '179М89 мехмат', 'fa9be3ja5wy', 2, null, null),
        (5331, 5133084146, 2, 'н', 'Олег', 'Никитенко', 'фонд Мельниченко, жюри ЛКТГ ТурГор, Физтех, АлтГУ от СА', 'qa9da2su5da2', 1, null, null),
        (6722, 1117612868, 2, 'н', 'Александра', 'Фетисова', 'репетитор (от Вани Яковлева)', 'ru2za9ta9be7', 1, null, null),
        (6735, 572492016, 2, 'н', 'Дарья', 'Слепых', 'матфак ВШЭ+ЦПМ совбак 1 курс (от Вербы)', 'vu4qe3ne2ku3', 1, null, null);

-- ======================
-- ======================

select * from lessons where lesson >= 20;
insert into main.lessons (id, group_id, lesson)
values  (61, 'н', 20),
        (62, 'п', 20),
        (63, 'э', 20),
        (64, 'н', 21),
        (65, 'п', 21),
        (66, 'э', 21),
        (67, 'н', 22),
        (68, 'п', 22),
        (69, 'э', 22),
        (70, 'н', 23),
        (71, 'п', 23),
        (72, 'э', 23),
        (73, 'н', 24),
        (74, 'п', 24),
        (75, 'э', 24);
-- ======================
-- ======================

select * from problems where lesson >= 20
order by random() limit 30
;

insert into main.problems (id, group_id, lesson, prob, item, title, prob_text, prob_type, ans_type, ans_validation, validation_error, cor_ans, cor_ans_checker, wrong_ans, congrat, synonyms)
values  (1181, 'э', 23, 8, '', 'Таблица и делимость', '', 4, '', '', '', '', '', '', '', '1181'),
        (1108, 'п', 22, 2, '', 'Наименьшее натуральное', '', 1, '2', '', 'Введите ответ — натуральное число', '599999', '', 'Нет, не такое число', 'В точку!', '1108'),
        (1022, 'п', 20, 8, 'б', 'Игра с улиткой 8x9', '', 4, '', '', '', '', '', '', '', '1022'),
        (1180, 'э', 23, 7, 'г', 'Часы планеты Тигарден - 05:60', '', 2, '', '', '', '', '', '', '', '1180'),
        (1041, 'э', 20, 12, '', 'Улитки на доске', '', 4, '', '', '', '', '', '', '', '1041'),
        (1159, 'п', 23, 7, 'а', 'Подводные козы - 1', '', 2, '', '', '', '', '', '', '', '1159'),
        (998, 'н', 20, 1, 'а', 'Сколько квадратиков - 5-я', '', 1, '2', '', 'Введите ответ — сколько квадратиков в 5-й фигуре', '29', '', 'Нет, не столько квадратиков', 'Да, всё верно!', '998'),
        (1195, 'н', 24, 9, '', 'Кого больше?', '', 4, '', '', '', '', '', '', '', '1195'),
        (1154, 'п', 23, 2, '', 'Города и деревни', '', 1, '2', '', 'Введите ответ — сколько дорог на острове', '108', '', 'Нет, не столько дорог', 'Да, всё верно!', '1154'),
        (1134, 'э', 22, 10, '', 'Тридцать три учёных', '', 4, '', '', '', '', '', '', '', '1134'),
        (1037, 'э', 20, 8, '', 'Лев и Кадавр', '', 4, '', '', '', '', '', '', '', '1037'),
        (1045, 'н', 21, 4, '', 'Поезд едет по мосту', '', 1, '2', '', 'Введите ответ — сколько секунд надо ждать водителю', '90', '', 'Нет, не столько секунд', 'Точно!', '1045'),
        (1087, 'э', 21, 9, 'в', 'Хромой король - 3', '', 4, '', '', '', '', '', '', '', '1087'),
        (1065, 'п', 21, 5, 'б', 'Наибольший путь улитки', '', 1, '2', '', 'Введите ответ — сколько километров может проползти улитка', '5', '', 'Нет, не столько километров', 'Да, всё верно!', '1065'),
        (1183, 'э', 23, 10, '', 'Костяшки домино', '', 4, '', '', '', '', '', '', '', '1183'),
        (1057, 'н', 21, 11, 'б', 'Игры мудрецов - 2', '', 4, '', '', '', '', '', '', '', '1057'),
        (1125, 'э', 22, 1, '', 'Клад пиратов', '', 1, '11', '', 'Введите ответ — три числа через запятую', '8,14,26', '', 'Нет, это неверно', 'Да, всё верно!', '1125'),
        (1148, 'н', 23, 11, 'а', 'Сумма трёх слагаемых - 1', '', 4, '', '', '', '', '', '', '', '1148'),
        (1184, 'э', 23, 11, '', 'Старушка, завхоз и кот Треугольник', '', 4, '', '', '', '', '', '', '', '1184'),
        (1123, 'п', 22, 11, '', 'Коллекция монет', '', 4, '', '', '', '', '', '', '', '1123'),
        (1121, 'п', 22, 10, 'а', 'Сломанные весы - 1', '', 4, '', '', '', '', '', '', '', '1121'),
        (1035, 'э', 20, 6, 'в', 'Замощение четырёхугольниками - 3', '', 2, '', '', '', '', '', '', '', '1035'),
        (1209, 'п', 24, 8, 'б', 'Проволочная сетка - 2', '', 4, '', '', '', '', '', '', '', '1209'),
        (1210, 'п', 24, 9, '', 'Четыре монеты', '', 4, '', '', '', '', '', '', '', '1210'),
        (1011, 'н', 20, 9, '', 'Футболисты и двоечники', '', 4, '', '', '', '', '', '', '', '1011'),
        (1155, 'п', 23, 3, '', 'Учительница задумала число', '', 1, '2', '', 'Введите ответ — двузначное число', '84', '', 'Нет, не такое число', 'Точно!', '1147;1155'),
        (1090, 'э', 21, 11, '', 'Ракушка на полоске', '', 4, '', '', '', '', '', '', '', '1074;1090'),
        (1100, 'н', 22, 8, '', 'Переправа рыцарей и лжецов', '', 4, '', '', '', '', '', '', '', '1100'),
        (1179, 'э', 23, 7, 'в', 'Часы планеты Тигарден - 03:42', '', 2, '', '', '', '', '', '', '', '1179'),
        (1141, 'н', 23, 5, '', 'Число по остатку', '', 1, '2', '', 'Введите ответ — двузначное число', '97', '', 'Нет, не такое число', 'Отлично!', '1141;1153');
-- ======================
-- ======================

select * from questions
         where user_id in (select * from _d_students) or user_id in (select * from _d_teachers)
order by random() limit 30
;
-- ======================
-- ======================

select * from reaction_enum;

insert into main.reaction_enum (reaction_id, reaction, reaction_type_id)
values  (0, '👌 Ок. Всё ясно.', 0),
        (1, '😕 Непонятно, что не так...', 0),
        (2, '🙋 Не могу согласиться с проверкой!', 0),
        (100, '🔥 Суперское решение.', 100),
        (101, '😕 Жуткая муть.', 100),
        (102, '😠 Решение, вероятно, списано.', 100),
        (103, '🤖 Решение, вероятно, от нейросети.', 100),
        (200, '👌 С устным приёмом всё ОК.', 200),
        (201, '😀 Сдавать понравилось!', 200),
        (202, '📡 Связь прервалась.', 200),
        (203, '😰 Сдавать не понравилось...', 200),
        (204, '⌛ Это старые плюсики поставили...', 200),
        (300, '👍 Внятно, уверенно.', 300),
        (301, '👎 Мутно, много ошибок.', 300),
        (302, '😠 Решение, вероятно, несамостоятельно.', 300),
        (303, '📡 Технические проблемы.', 300);
-- ======================
-- ======================

select * from reaction_type_enum;

insert into main.reaction_type_enum (reaction_type_id, reaction_type)
values  (0, 'Письменно, ученик'),
        (100, 'Письменно, учитель'),
        (200, 'Устно, ученик'),
        (300, 'Устно, учитель');
-- ======================
-- ======================

select * from reactions where
result_id in (select id from results where student_id in (select * from _d_students) or teacher_id in (select * from _d_teachers) and lesson >= 20)
or zoom_conversation_id in (select id from zoom_conversation where student_id in (select * from _d_students) or teacher_id in (select * from _d_teachers)and lesson >= 20)
order by random() limit 30
;

insert into main.reactions (id, ts, result_id, zoom_conversation_id, reaction_id, reaction_type_id)
values  (10688, '2026-02-16T10:25:52.420555', 172728, null, 0, 0),
        (431, '2025-09-09T11:47:27.160701', 11812, null, 0, 0),
        (10718, '2026-02-16T18:20:50.506311', null, 3623, 201, 200),
        (3876, '2025-10-14T19:52:41.712699', 52706, null, 0, 0),
        (919, '2025-09-13T16:23:08.948509', 16315, null, 0, 0),
        (7755, '2025-12-13T19:14:54.834932', 121854, null, 0, 0),
        (10074, '2026-02-07T18:24:39.442952', 165221, null, 0, 0),
        (9808, '2026-02-01T10:21:12.519083', 159468, null, 0, 0),
        (9874, '2026-02-02T09:02:49.247637', 159594, null, 0, 0),
        (10215, '2026-02-08T20:37:12.556294', 166639, null, 0, 0),
        (6149, '2025-11-18T18:33:23.484963', null, 1858, 200, 200),
        (10172, '2026-02-08T15:09:00.637924', 166250, null, 101, 100),
        (10429, '2026-02-13T12:16:12.410830', 170100, null, 0, 0),
        (9791, '2026-01-31T20:28:32.070753', 159115, null, 1, 0),
        (9576, '2026-01-25T18:49:11.158478', 154718, null, 0, 0),
        (10544, '2026-02-14T23:05:41.043608', 171509, null, 0, 0),
        (9647, '2026-01-28T14:25:06.458887', null, 3232, 201, 200),
        (9445, '2026-01-24T18:05:10.448983', 153174, null, 0, 0),
        (9740, '2026-01-30T22:46:19.935678', 158355, null, 0, 0),
        (6713, '2025-11-27T15:42:12.903432', 104268, null, 0, 0),
        (10559, '2026-02-15T10:21:29.445468', 171730, null, 1, 0),
        (889, '2025-09-13T14:13:44.783984', 12497, null, 0, 0),
        (8849, '2026-01-07T14:00:58.598641', 141732, null, 1, 0),
        (1001, '2025-09-13T20:05:55.717229', 17074, null, 0, 0),
        (10716, '2026-02-16T18:18:34.457247', null, 3622, 200, 200),
        (5995, '2025-11-16T13:51:29.556069', 89535, null, 0, 0),
        (10058, '2026-02-07T10:41:35.539497', 164785, null, 0, 0),
        (9650, '2026-01-28T16:35:34.537353', 156882, null, 2, 0),
        (9712, '2026-01-29T22:58:50.881630', 157910, null, 0, 0),
        (6196, '2025-11-19T17:26:51.081754', null, 1881, 200, 200);
-- ======================
-- ======================

select * from results
where student_id in (select * from _d_students) and
      (teacher_id in (select * from _d_teachers) or teacher_id is null) and lesson >= 20
order by random() limit 30;

insert into main.results (id, student_id, problem_id, group_id, lesson, teacher_id, ts, verdict, answer, res_type, check_time_spent_sec, zoom_conversation_id)
values  (162483, 7656, 1128, 'э', 22, null, '2026-02-03T17:31:20.769859', 18, '1/3', 1, null, null),
        (170911, 7317, 1139, 'н', 23, null, '2026-02-14T12:26:03.167270', 18, '30', 1, null, null),
        (153540, 7435, 1029, 'э', 20, null, '2026-01-24T22:05:32.334878', -1, '181', 1, null, null),
        (154093, 7281, 1002, 'н', 20, null, '2026-01-25T13:44:17.860230', 18, '25', 1, null, null),
        (168927, 7282, 1140, 'н', 23, null, '2026-02-10T20:38:31.283514', 18, '9', 1, null, null),
        (161743, 7309, 1104, 'н', 22, null, '2026-02-03T11-35-00.973248', 17, null, 4, null, null),
        (157063, 7317, 1045, 'н', 21, null, '2026-01-28T17:33:34.726658', 18, '90', 1, null, null),
        (153542, 7435, 1029, 'э', 20, null, '2026-01-24T22:07:51.830894', 18, '362', 1, null, null),
        (173166, 7476, 1223, 'э', 24, 6722, '2026-02-16T18:18:32.249694', 18, null, 3, null, 3622),
        (159541, 7281, 1045, 'н', 21, null, '2026-02-01T11:13:21.775979', 18, '90', 1, null, null),
        (162538, 7230, 1097, 'н', 22, null, '2026-02-03T18:02:33.043979', 18, '25', 1, null, null),
        (157160, 7309, 1056, 'н', 21, 5331, '2026-01-28T18:12:21.991121', 18, null, 3, null, 3275),
        (169769, 7551, 1159, 'п', 23, 6722, '2026-02-12T15:39:04.667589', 11, null, 2, 17, null),
        (150779, 7680, 1014, 'п', 20, null, '2026-01-20T18:34:01.818923', 18, '640', 1, null, null),
        (166348, 7435, 1128, 'э', 22, null, '2026-02-08T16:32:47.769136', 18, '1/3', 1, null, null),
        (159494, 7718, 1077, 'э', 21, null, '2026-02-01T10:45:49.977465', 18, '10', 1, null, null),
        (150367, 7718, 1025, 'п', 20, null, '2026-01-20T09-04-43.951651', 17, null, 4, null, null),
        (170992, 7551, 1163, 'п', 23, 6722, '2026-02-14T14:00:10.911146', 18, null, 2, 55, null),
        (174783, 7551, 1204, 'п', 24, null, '2026-02-18T17:38:20.453969', 18, '20, 2, 6', 1, null, null),
        (166051, 7281, 1104, 'н', 22, 6722, '2026-02-08T12:59:30.641244', 18, null, 2, 3, null),
        (150648, 7551, 1025, 'п', 20, 4, '2026-01-20T17:17:58.814778', 18, null, 3, null, 3077),
        (151633, 7317, 1000, 'н', 20, null, '2026-01-21T21:53:37.170350', -1, '18', 1, null, null),
        (154053, 7281, 1001, 'н', 20, null, '2026-01-25T13:19:55.241532', 18, '100', 1, null, null),
        (173146, 7796, 1217, 'э', 24, null, '2026-02-16T18:08:17.141599', 18, '23:50:25', 1, null, null),
        (158026, 7476, 1079, 'э', 21, null, '2026-01-30T15:56:26.379509', 18, '1', 1, null, null),
        (159789, 7230, 1059, 'п', 21, null, '2026-02-01T13:15:13.693441', -1, '1,5,6', 1, null, null),
        (156110, 7673, 1087, 'э', 21, null, '2026-01-26T21-32-06.309466', 17, null, 4, null, null),
        (167008, 7656, 1183, 'э', 23, 5331, '2026-02-09T17:54:36.728307', -1, null, 3, null, 3445),
        (174629, 7476, 1216, 'э', 24, null, '2026-02-18T12:17:25.064417', 18, '15,27,24', 1, null, null),
        (164880, 7718, 1111, 'п', 22, null, '2026-02-07T11:58:40.265187', 18, '27,9;81,3,1', 1, null, null);
-- ======================
-- ======================

select * from states
where user_id in (select * from _d_students) or user_id in (select * from _d_teachers)
;

insert into main.states (user_id, state, problem_id, last_student_id, last_teacher_id, oral_problem_id, info)
values  (7230, 2, 0, 0, 0, null, null),
        (7281, 2, 0, 0, 0, null, null),
        (7282, 1, 0, 0, 0, null, null),
        (7309, 2, 0, 0, 0, null, null),
        (7317, 2, 0, 0, 0, null, null),
        (7435, 2, 0, 0, 0, null, null),
        (7476, 2, 0, 0, 0, null, null),
        (7550, 2, 0, 0, 0, null, null),
        (7551, 2, 0, 0, 0, null, null),
        (7656, 2, 0, 0, 0, null, null),
        (7673, 2, 0, 0, 0, null, null),
        (7680, 2, 0, 0, 0, null, null),
        (7703, 2, 0, 0, 0, null, null),
        (7718, 4, 1204, 0, 0, null, null),
        (7796, 2, 0, 0, 0, null, null),
        (4, 6, 0, 0, 0, null, null),
        (4234, 6, 0, 0, 0, null, null),
        (5331, 10, 0, 0, 0, null, null),
        (6722, 6, 0, 0, 0, null, null),
        (6735, 6, 0, 0, 0, null, null);
-- ======================
-- ======================

select * from verdicts;

insert into main.verdicts (id, tick, val)
values  (-32768, '⬜', 0),
        (-2, '🟥−', 0),
        (-1, '🟥−', 0),
        (1, '✅+', 1),
        (11, '🟥−', 0),
        (12, '🟥−.', 0.05),
        (13, '🟥∓', 0.25),
        (14, '🟧+∕2', 0.5),
        (15, '🟨±', 0.7),
        (16, '✅+.', 0.95),
        (17, '✅+', 1),
        (18, '✅+', 1);
-- ======================
-- ======================

select * from written_tasks_discussions
where student_id in (select * from _d_students) and
      (teacher_id in (select * from _d_teachers) or teacher_id is null)
     and problem_id in (select id from problems where lesson>=20)
order by random() limit 30;

insert into main.written_tasks_discussions (id, ts, student_id, problem_id, teacher_id, text, attach_path, chat_id, tg_msg_id)
values  (56030, '2026-01-30T20:28:16.215137', 7476, 1082, null, null, null, 7236643899, 13296234),
        (57496, '2026-02-01T18:44:22.658659', 7796, 1088, null, 'Обратим внимание на то, что в трёх примерах встречаются десять различных букв(А, Б, В, Г, Д, Е, Ё, Ж, И, К), а значит участвуют все 10 цифр. Посчитаем сумму всех эти 10 цифр: 0 + 1 + 2 + 3 + 4 + 5 + 6 + 7 + 8 + 9 = 45. Это число - нечётное.
Рассмотрим сумму цифр(чисел) в каждом примере:
1. А + Б = В, поэтому сумму цифр в этом примере будет - В + В = 2В(заметим, что это число - чётное)
2. Г - Д = Е, отсюда получаем, что Г = Д + Е, и тогда сумма цифр будет - Г + Г = 2Г, то есть чётное число.
3.Ё + Ж - И = К, то Ё + Ж = И + К, и находим сумму:  И + К + И + К = 2(И + К), и снова чётное число.
Теперь складываем эти суммы и мы получаем сумму всех цифр, которые есть в примере: 2В + 2Г + 2(И + К), но, мы складываем чётные числа, а значит и сумма будет чётная: Ч + Ч = Ч. Но сумма всех различных цифр - нечётное число, следовательно, отсюда выходит противоречие.
Теперь мы точно понимаем, что Ваня точно ошибся.', null, 5430820763, 13318458),
        (55122, '2026-01-25T18:26:02.012841', 7230, 1007, 4, 'Ок', null, 586091311, 13263445),
        (55792, '2026-01-29T21:06:04.769617', 7680, 1067, null, null, null, 8342729182, 13292708),
        (62064, '2026-02-15T12:54:05.682531', 7281, 1146, null, null, null, 6706299281, 13428872),
        (55459, '2026-01-28T13:45:40.987903', 7656, 1089, null, null, null, 6868442647, 13284412),
        (54795, '2026-01-25T15:17:30.429822', 7282, 1010, null, 'Суть та же- ходишь первым и оставляешь сопернику нечетное количество. Для случая с 5ю конфетами: ходить первому и сьесть 2 конфеты, тогда выиграешь', null, 6706299281, 13258954),
        (59361, '2026-02-08T11:25:44.386182', 7230, 1099, 4, 'Попробуйте покатать кубик', null, 586091311, 13370039),
        (56874, '2026-02-01T09:39:04.675972', 7435, 1084, 4, 'Нагляднее будет написать в строку все возможные количества спичек в игре и отметить выигрышные и проигрышные позиции.
Например, если игрок начинает с одной спички, какая это позиция?
Из выигрышной позиции всегда есть ход в проигрышную позицию.
Из проигрышной позиции ход есть только в выигрышную.', null, 586091311, 13310325),
        (56510, '2026-01-31T18:20:33.503135', 7309, 1050, null, null, null, 304220222, 13303793),
        (62302, '2026-02-15T15:59:16.601225', 7796, 1183, null, 'В полном наборе домино(от 0 до 6) каждая цифра встречается ровно 8 раз: к примеру, цифра 3 есть на костях: 0,3; 1,3; 2,3; 3,3; 4,3; 5,3; 6,3. Нечётные цифры(1, 3 и 5) встречаются по 8 раз, а значит всего половинок, на которых нечётная цифра - 8 × 3 = 24. Чётные цифры(0, 2, 4, 6) также встречаются по 8 раз, а значит половинок с чётным числом - 8 × 4 = 32 штуки.
В замкнутой цепочке каждая половинка касается ровно с одной половинкой другой кости. По условия задачи, разность чисел в каждой такой паре равна 1. Это возможно только в том случае, если эти числа разной чётности: 1 + Ч = Н; 1 + Н = Ч.  Значит все 56 половинок(8 × 7) разбиваются на 28 пар, в каждой из которых одно чётное и одно нечётное число. Но, тогда чётных и нечётных чисел должно быть поровну, то есть по 28. Но, мы выяснили, что в полном наборе домино всего 24 нечётных и 32 чётных числа - противоречие.
Поэтому такую цепочку составить невозможно.', null, 5430820763, 13432421),
        (62063, '2026-02-15T12:53:40.021545', 7281, 1145, null, null, null, 6706299281, 13428868),
        (53465, '2026-01-22T18:38:22.497537', 7680, 1024, null, null, null, 8342729182, 13235624),
        (61517, '2026-02-14T15:51:22.902565', 7309, 1143, null, null, null, 304220222, 13420110),
        (59330, '2026-02-08T11:07:13.609413', 7230, 1099, null, null, null, 1896934150, 13369718),
        (61450, '2026-02-14T14:20:13.172038', 7551, 1159, 6722, 'Отлично. Вы близки к правильному ответу. Вы не учли, что коза привязана к столбику, имеющему высоту. Как будет зависеть область доступа козы от высоты столбика?', null, 1117612868, 13417255),
        (61208, '2026-02-13T23:23:08.373248', 7230, 1143, 4, 'Хорошо', null, 586091311, 13414073),
        (55294, '2026-01-26T21:22:08.834162', 7680, 1068, null, null, null, 8342729182, 13277026),
        (55116, '2026-01-25T18:25:21.694776', 7230, 1005, null, null, null, 1896934150, 13263399),
        (58573, '2026-02-06T20:50:54.197832', 7281, 1102, null, null, null, 6706299281, 13355820),
        (61099, '2026-02-13T21:03:29.767094', 7680, 1162, null, null, null, 8342729182, 13412577),
        (61261, '2026-02-14T08:44:36.972068', 7680, 1159, 6722, 'Отлично. Вы не учитываете, что коза привязана к столбику. Есть ли у него высота? Зависит ли область доступа козы от высоты столбика?', null, 1117612868, 13414738),
        (62394, '2026-02-15T16:42:39.034152', 7435, 1176, null, null, null, 6225539565, 13433753),
        (62664, '2026-02-15T18:57:18.478136', 7796, 1177, null, null, null, 5430820763, 13436704),
        (59341, '2026-02-08T11:14:00.597683', 7230, 1099, null, null, null, 1896934150, 13369830),
        (62667, '2026-02-15T18:57:58.598482', 7796, 1179, null, null, null, 5430820763, 13436730),
        (54509, '2026-01-25T11:01:47.590055', 7317, 1008, null, null, null, 7492202712, 13254006),
        (62628, '2026-02-15T18:45:27.390843', 7796, 1184, null, 'Начнём с того, что если два бегуна начали в определённом порядке, то за весь забег кол-во обгонов одного над другим может отличаться не более чем на 1, ведь бегун, который уже обогнал второго, не может "дважды" обогнать его, а когда второй обгонит первого, то кол-во обходов между ними снова приравнивается.
Если Завод финишировал первым(как и было изначально), то это означает, что его обогнали ровно 16 раз, но при каждом обгоне он менял позицию двух бегунов(конкретно завхоза и кота; завхоза и старухи) на исходную, то есть он обогнал 16 раз. Нужно заметить, что кот и старуха в сумме совершили 16 обгонов, а следовательно между собой они не меняли позиций(то есть в каком порядке они начинали, в таком и прибежали). В таком случае, завхоз, кот и старушка прибежали в таком же порядке, в котором начинали.
Если первым прибежал кот, то завхоза обогнали минимум 17 раз(он совершил 16 обгонов, но в итоге прибежал не первым, то есть его обогнали более чем 16 раз). Но, суммарно кот и старушка совершили всего 16 обгонов, а чтобы завхоз не был на первом месте, его нужно обогнать минимум 17 раз, поэтому возникает противоречие.
Такая же ситуация будет, если первая прибежала старушка(в любом случае завхоза нужно обогнать минимум 17 раз, чтобы он не был первым, но старуха и кот сделали всего 16 обгонов).
Таким образом, завхоз, кот и старушка прибежали в таком же порядке, что и начинали(то есть, первый прибежал завхоз, за ним кот, а за котом - старушка).', null, 5430820763, 13436212),
        (62070, '2026-02-15T12:59:56.684855', 7282, 1143, null, null, null, 6706299281, 13428927),
        (53121, '2026-01-20T19:06:47.444155', 7680, 1020, null, null, null, 8342729182, 13222266);
-- ======================
-- ======================

select * from written_tasks_queue
where student_id in (select * from _d_students) and
      (teacher_id in (select * from _d_teachers) or teacher_id is null)
     and problem_id in (select id from problems where lesson>=20)
order by random() limit 30;

insert into main.written_tasks_queue (id, ts, student_id, problem_id, cur_status, teacher_ts, teacher_id)
values  (129, '2026-02-18T18:55:55.406522', 7656, 1219, 0, null, null);